## pandas

In [33]:
import pandas as pd

In [34]:
data_frame=pd.DataFrame()

In [35]:
type(data_frame)

pandas.core.frame.DataFrame

In [36]:
list
dics
series
numpy array

SyntaxError: invalid syntax (2970978154.py, line 4)

In [37]:
data=[1,2,3,4,5]

In [38]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [39]:
data2=[["somu",26],["manish",18],["priya",23]]

In [40]:
data_frame2=pd.DataFrame(data2,columns=["name","age"],index=["first","second","third"])

In [41]:
data_frame2

          name  age
first     somu   26
second  manish   18
third    priya   23

In [42]:
data3={"name":["somu","sunny"],"age":[27,25]}

In [43]:
data_frame3=pd.DataFrame(data3)

In [44]:
data_frame3

    name  age
0   somu   27
1  sunny   25

In [45]:
data4=[{"sunny":25},{"somu":31,"amit":35,"rahul":35}]

In [46]:
pd.DataFrame(data4)

   sunny  somu  amit  rahul
0   25.0   NaN   NaN    NaN
1    NaN  31.0  35.0   35.0

In [51]:
pd.read_csv("text.csv")

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655
2  monic   15   web    2555

In [55]:
pd.read_csv("dataset/text2.tsv",sep='\t')

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655
2  monic   15   web    2555

In [57]:
data='''{"name":"somu",
      "phone":54546545,
      "company_name":["xyz","abc","123"]
    
}'''

In [59]:
import json
d=json.loads(data)

In [60]:
type(d)

dict

In [61]:
pd.DataFrame(d)

   name     phone company_name
0  somu  54546545          xyz
1  somu  54546545          abc
2  somu  54546545          123

In [63]:
pd.read_csv("https://raw.githubusercontent.com/sunnysavita10/Statistics-With-Python-CompleteGuide/refs/heads/main/googleplaystore.csv")

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [64]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\acer\downloads\iiiiii\lib\site-packages (5.2.1)

In [66]:
data=pd.read_csv("text.csv")